"""За даним цілим додатнім числом n
обчисліть n! - значення факторіалу цього числа.

||| курс, Бритвич Олександр Володимирович (ПІБ)"""


# Функція для знаходження "готового результату" факторіалу
def stable_factorial(n):
    # Ініціалізація змінної, що буде містити значення факторіалурнуекгру3
    factorial = 1

    # Цикл for, що проходить від 1 до n-ої цифри вхідного числа
    for i in range(1, n + 1):
        # Кожен крок циклу додає новий множник до факторіалу
        factorial *= i

    # Виведення результату
    print(f"{n}! =", factorial)


# Безкінечний цикл для введення числа
while True:
    try:
        # Зчитування введеного користувачем цілого додатнього числа
        user_input = int(input("Введіть ціле додатнє число. Для закінчення програми введіть 0\n"))

        # Перевірка, чи користувач ввів 0 для завершення програми
        if user_input == 0:
            print("Програма завершена")
            # Вихід з циклу при даній умові
            break
        else:
            # Виведення функції для обробки вхідних даних
            stable_factorial(user_input)
            print()

    # При умові наступної помилки виводиться попередження
    except ValueError:
        print("Будь ласка, введіть коректне ціле число")
