"""Назвемо число паліндромом, якщо воно не змінюється при перестановці
його цифр у зворотному порядку.

Напишіть програму, яка за введеним користувачем числом n (1 ≤ n ≤ 100000)
виводить числа-паліндроми, які не перевищують n.

||| курс, Бритвич Олександр Володимирович (ПІБ)"""


# Функція для перевірки, чи число є паліндромом
def is_palindrome(num):
    return str(num) == str(num)[:: -1]


# Функція для створення списку паліндромів в заданому діапазоні
def create_palindrome(n):
    palindrome = []

    # Перебираємо числа від 1 до n
    for i in range(1, n + 1):
        # Перевіряємо, чи є поточне число паліндромом, використовуючи попередню функцію
        if is_palindrome(i):
            # Додаємо паліндром у список
            palindrome.append(i)

    print(f"\nОтже, числа-паліндроми від 1 до {n}:", ", ".join(map(str, palindrome)), "\n")


# Безкінечний цикл для введення
while True:
    try:
        # Зчитуємо введення від користувача як ціле число
        user_input = int(input("Введіть ціле число у проміжку 1 ≤ n ≤ 100000. Натисніть 0 для завершення програми. "))

        # Перевіряємо, чи введене число відповідає основній умові
        if 1 <= user_input <= 100000:
            # Викликаємо функцію для створення паліндромів
            create_palindrome(user_input)
        # Перевіряємо, чи користувач ввів 0 для завершення програми
        elif user_input == 0:
            print("Програма завершена")
            break
        else:
            # Повідомлення користувачу в разі помилку у введенні
            print("Введене число не відповідає умові завдання.\nВведіть число у проміжку 1 ≤ n ≤ 100000")

    # Перехоплюємо помилку, якщо введене значення не є цілим числом
    except ValueError:
        print("Будь ласка, введіть ціле число")
